დავალება:

//1.მოცემულია მასიცი:
//let array2 = [14, 150, 'css', null, 'javascript', 25];

//შექმენით ახალი მასივი map ფუნქციის საშუალებით შემდეგი ლოგიკით: თუ ელემენტი არის რიცხვი, ამ მასივში უნდა იყოს ამ რიცხვის კვადრატი. თუ ელემენტი არის სტირნგი, მაშინ ახალ მასივში უნდა იყოს ეს ტექსტი დიდი ასოებით. სხვა შემთხვევაში ელემენტი უნდა დაემატოს უცვლელად.

let array2 = [14, 150, 'css', null, 'javascript', 25];

let numberarray = array2.map ( (item) => Math.pow (item,2));

console.log(numberarray);

//2. prompt ფუნქციის საშუალებით კითხეთ მომხმარებელს შემდეგი კითხვა: საქართველოს დედაქალაქი? სწორი პასუხი ჩაწერეთ პატარა ასობიეთ და  შეინახეთ ცვლადში. როდესაც მიიღებთ პასუხს მომხმარებლისგან, გადაიყვანეთ ეს პასუხი პატარა ასოებად და შეადარეთ სწორ პასუხს. თუ მომხმარებლის პასუხი სწორია, დაბეჭდეთ სწორია, თუ არა მაშინ დაბეჭდეთ არასწორია.


//3. მოცემულია მასივი:
//let  array5 = [12, 25, 3, 6, 8, 14, 7, 23];
//map-ის გამოყენებით შექმენით ახალი მასივი, რომელშიც array მასივიდან თითოეული ელემენტი იქნება 3-ზე გაყოფილი;


//4. .მოცემულია მასივი, შემდეგი მნიშვნელობებით - let array1 =[“hello1”, 14,24, “hello2”] გამოიტანეთ მარტო ციფრები მეთოდის საშუალებით;


//5. .მოცემულია მასივი:
//let languages = ['html', 'css', 'javascript', ‘python’, 'php'];
//ფილტრის საშულებით გაფილტრეთ და გამოიტანეთ მარტო ის სიტყვა რომლის სიმბოლოების რაოდენობა იქნება 3-ზე მეტი;

//6. .მოცემულია მასივი:
//let words = ['Madrid', 'rome', 'Milan', 'berlin'];
//filter მეთოდის საშუალებით დააბრუნეთ მასივი, რომელიც შედგება ისეთი სიტყვებისგან რომელიც შეიცავს ასო m-ს ან M-ს;

//7. მოცემულია: let link = “https://google.com”. დაწერეთ ფუნქცია, რომელიც პარამეტრად იღებს ამ ცვლადს, და შეამოწმეთ მეთოდის საშუალებით არის თუ არა ამ ცვლადში “https://“. თუ კი გამოიტანეთ - კი მოიცავს, თუ არა - არა, არ მოიცავს

//8. შეამოწმეთ მოცემულ მასივში let array6 = [-1, -2, -3, 4]; არის თუ არა ერთი მაინც დადებითი რიცხვი some მეთოდით.

//9. .მოცემულია სტრინგი - ‘12345’, გაიგეთ ამ რიცხვებსის ჯამი. ( უნდა გადაიყავნოთ მასივში, გათ
//ვალოთ ჯამი, და შემდგ თითოეული სტრინგი გადაიყავნოთ რიცხვში)


//10.Გამოთვალეთ ნებისმიერი რიცხვებს ჯამი reduce მეთოდით

1//1. Გაერთიანეთ სამი მასივის მნიშვენლობები let arr1 = [1, 2];
//let arr2 = [3, 4];
//let arr3 = [5, 6];
 //Ერთ მასივში
